src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("АдресДанных") Тогда
        ДанныеТЗ = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
        ПостроитьДиаграмму(ДанныеТЗ, Параметры.ТекущийГод);
    КонецЕсли;
    	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграмму(ДанныеТЗ, Год)
	
    Объект.Год = Год; 
    
    ЧислоВыбранногоГода = Год(Объект.Год);
    
    ДиаграммаГанта.Обновление = Ложь;
    ДиаграммаГанта.Очистить(); 
    ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь; 
    
  	НачалоГрафика = Дата(ЧислоВыбранногоГода, 1, 1);
	КонецГрафика  = КонецДня(Дата(ЧислоВыбранногоГода, 12, 31));
	
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГрафика, КонецГрафика);
   
    
    Серия = ДиаграммаГанта.УстановитьСерию("Отпуска"); 
	
	Серия.Текст = Серия.Значение;
    
    Для Каждого Строка Из ДанныеТЗ Цикл
    	Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник); 
		Точка.Текст = Точка.Значение;
    
   		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
   		Интервал = Значение.Добавить();
   		Интервал.Начало = Строка.ДатаНачала; 
        Интервал.Конец = Строка.ДатаОкончания; 
   
    КонецЦикла;   
       
КонецПроцедуры
